#include "library.hpp"
#include <iostream>

int main()
{
    Book *b1 = new Book("Евгений Онегин", "Пушкин", 600);
    Book *b2 = new Book("Так сказал Заратустра", "Фридрих Ницше", 412);
    Book *b3 = new Book("Вечера на хуторе близ Диканьки", "Николай Гоголь", 340);

    Library blib;

    blib.AddBook(b1, 1);
    blib.AddBook(b2, 1);
    blib.AddBook(b3, 1);

    std::cout << blib<< std::endl;

    blib.TakeBook("Евгений Онегин");
    blib.TakeBook("Вечера на хуторе близ Диканьки");

    std::cout << blib << std::endl;

    blib.ReturnBook("Евгений Онегин");

    std::cout << blib << std::endl;

    delete b1;
    delete b2;
    delete b3;

    return 0;
}

/*
int main()
{
    //
    Книга *b1 = new Книга("Евгений Онегин", "Пушкин", 600);
    Книга *b2 = new Книга("Так сказал Заратустра", "Фридрих Ницше", 412);
    Книга *b3 = new Книга("Вечера на хуторе близ Диканьки", "Николай Гоголь", 340);
    //
    Библиотека хпи_библиотека;

    хпи_библиотека.ДобавитьКнигу(b1, 1);
    хпи_библиотека.ДобавитьКнигу(b2, 1);
    хпи_библиотека.ДобавитьКнигу(b3, 1);

    std::cout << хпи_библиотека << std::endl;

    хпи_библиотека.ВзятьКнигу("Евгений Онегин");
    хпи_библиотека.ВзятьКнигу("Вечера на хуторе близ Диканьки");

    std::cout << хпи_библиотека << std::endl;

    хпи_библиотека.ВернутьКнигу("Евгений Онегин");

    std::cout << хпи_библиотека << std::endl;

    delete b1;
    delete b2;
    delete b3;

    return 0;
}
*/
